## Lesson 5 - Grouping and Joining pandas DataFrame

**Creating two dataframes to merge**

```JSON
data_1 = { 
"Numbers" : [5,3,9],
"Destination" : ["Takorade", "Florida", "New York"]
}

data_2 = { 
"Numbers" : [5,9,7],
"Amount" : [10.0, 5.0, 2.5]
}
```
**Transform the datasets into a dataframe** 

```python
#Import pandas as pd
sample_A = pd.DataFrame(data_1)
sample_B = pd.DataFrame(data_2)
```
**There are four types to merge two dataframes**

1. Inner join

```python
#joining dataframe with innerjoin
sample_inner = pd.merge(sample_A, sample_B, on = "Numbers", how= "inner")
#intersection of the two datasets
sample_inner
```
2. outer join

```python
#merging two data frames, but where there is missing data, NaN will be filled in the space
sample_outer = pd.merge(sample_A, sample_B, on = "Numbers", how= "outer") #the outer merge is like a union
sample_outer
```
3. Right outer join

```python
#lEFT OUTERJOIN
sample_right= pd.merge(sample_A, sample_B, on = "Numbers", how= "right") #the outer merge is like a union
sample_right
``` 
4. Left outer join

```python
#right outerjoin
sample_left= pd.merge(sample_A, sample_B, on = "Numbers", how= "left") #the outer merge is like a union
sample_left
```
**Working with missing values**

```python
#working with missing values
sample_outer.isnull().sum() #to check the number of NaN values within my dataset (columns)
#dropping NaN values in a dataset
sample_outer.dropna(inplace=True) #this will drop all the roles in my data which have NaN
sample_outer
#filling NaN values with the mean of the values within that same column where the NaN is
sample_left.fillna(sample_left.mean(), inplace= True) #the inplace makes the changes to the data 
sample_left
```

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

In [1]:
data_1 = { 
"Numbers" : [5,3,9],
"Destination" : ['Takorade', 'Florida', "New York"]
}
data_2 = { 
"Numbers" : [5,9,7],
"Amount" : [10.0, 5.0, 2.5]
}

In [3]:
sample_A = pd.DataFrame(data_1)
sample_B = pd.DataFrame(data_2)

In [4]:
sample_A

   Numbers Destination
0        5    Takorade
1        3     Florida
2        9    New York

In [5]:
sample_B

   Numbers  Amount
0        5    10.0
1        9     5.0
2        7     2.5

In [6]:
#joining dataframe with innerjoin
sample_inner = pd.merge(sample_A, sample_B, on = "Numbers", how= "inner")
#intersection of the two datasets
sample_inner

   Numbers Destination  Amount
0        5    Takorade    10.0
1        9    New York     5.0

In [7]:

#merging two data frames, but where there is missing data, NaN will be filled in the space
sample_outer = pd.merge(sample_A, sample_B, on = "Numbers", how= "outer") #the outer merge is like a union
sample_outer

   Numbers Destination  Amount
0        5    Takorade    10.0
1        3     Florida     NaN
2        9    New York     5.0
3        7         NaN     2.5

In [8]:
#lEFT OUTERJOIN
sample_left= pd.merge(sample_A, sample_B, on = "Numbers", how= "left") #the outer merge is like a union
sample_left

   Numbers Destination  Amount
0        5    Takorade    10.0
1        3     Florida     NaN
2        9    New York     5.0

In [9]:
#right outerjoin
sample_right= pd.merge(sample_A, sample_B, on = "Numbers", how= "right") #the outer merge is like a union
sample_right

   Numbers Destination  Amount
0        5    Takorade    10.0
1        9    New York     5.0
2        7         NaN     2.5

In [11]:
#working with missing values

sample_outer.isnull().sum() #to check the number of NaN values within my dataset (columns)

Numbers        0
Destination    1
Amount         1
dtype: int64

In [13]:
#dropping NaN values in a dataset
#this will drop all the roles in my data which have NaN
sample_outer.dropna(inplace=True)
sample_outer

   Numbers Destination  Amount
0        5    Takorade    10.0
2        9    New York     5.0

In [15]:
#filling NaN values with the mean of the values within that same column where the NaN is
sample_left.fillna(sample_left.mean(), inplace= True) #the inplace makes the changes to the data 
sample_left

/var/folders/z5/dhkg6161095gnyr57s64lq7m0000gn/T/ipykernel_23097/1427045000.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sample_left.fillna(sample_left.mean(), inplace= True)

   Numbers Destination  Amount
0        5    Takorade    10.0
1        3     Florida     7.5
2        9    New York     5.0

In [1]:
import seaborn as sns

In [ ]:
data = {
"Name":
"Employment": []
"Age"
}